org/20221220213604-aeppl_and_elements_of_multi_dimensional_random_variables.org
:PROPERTIES:
:ID:       c57dd926-5e8a-46c0-8af2-44e0dde4beb7
:END:
#+title: AePPL and elements of multi-dimensional random variables

With AePPL/AeMCMC one should be able to condition on /some/ components of a multivariate distribution:

#+begin_src python
import aeppl
import aesara.tensor as at

srng = at.random.RandomStream(0)

mu = at.vector("mu")
sigma = at.matrix("sigma")
idx = at.iscalar("i")
X_rv = at.random.multivariate_normal(mu, sigma)

Z_rv = X_rv[:idx]
Y_rv = X_rv[idx:]

logprob, (z_vv,) = aeppl.joint_logprob(Z_rv, realized={Y_rv: y_obs})
#+end_src

See [[https://cdn.discordapp.com/attachments/894592276184043570/1054454175502704751/doucet_simulationconditionalgaussian.pdf][these notes]] for applications of this, and how to efficiently do it.
